---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Dispose
source: html/7915f167-a6ea-659d-ced8-fecb38f5a5f1.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Dispose Method

Releases all resources used by the DuctPressureDropData

## Syntax (C#)
```csharp
public void Dispose()
```